{
  "sidebar": "Experiencia",
  "present": "Presente",
  "experience": [
    {
      "company": "Independiente (Freelancer)",
      "position": "Desarrollador Full Stack",
      "dateInit": "2021-08",
      "dateEnd": "2021-10",
      "website": {
        "url": "https://www.lamusitekadeabner.com/",
        "show": true
      },
      "description": [
        "Desarrollar página web independiente para proporcionar un servicio de radio en línea."
      ],
      "technologies": ["JavaScript", "HTML", "CSS", "Git", "GitHub"]
    },
    {
      "company": "EOL Solutions SAS",
      "position": "Desarrollador Full Stack",
      "dateInit": "2022-02",
      "dateEnd": "2023-07",
      "website": {
        "url": "https://www.eolsolutions.com.co/",
        "show": true
      },
      "description": [
        "Liderar el desarrollo y escalamiento de una plataforma de Ecommerce, integrando soluciones de Frontend y Backend.",
        "Colaborar en la definición de UX/UI junto al equipo de diseño, traduciendo requisitos complejos en componentes técnicos funcionales y responsivos."
      ],
      "technologies": [
        "JavaScript",
        "TypeScript",
        "React",
        "HTML",
        "CSS",
        "SASS",
        "StyledComponents",
        "TailwindCSS",
        "Vite",
        "Zustand",
        "I18next",
        "ReactHookForm",
        "ReactRouter",
        "Jest",
        "Postman",
        "Express",
        "Git",
        "GitHub",
        "AWS",
        "Figma"
      ]
    },
    {
      "company": "BPO2B Global Inc (Freelancer)",
      "position": "Desarrollador Front End",
      "dateInit": "2023-08",
      "dateEnd": "2023-09",
      "website": {
        "url": "https://bpolabsolutions.com/",
        "show": true
      },
      "description": [
        "Implementar módulos de Dashboard bajo Arquitectura Hexagonal, garantizando el desacoplamiento de la lógica de negocio y facilitando la testabilidad del sistema."
      ],
      "technologies": [
        "TypeScript",
        "React",
        "HTML",
        "StyledComponents",
        "TailwindCSS",
        "Vite",
        "Zustand",
        "ReactHookForm",
        "ReactRouter",
        "Postman",
        "Git",
        "GitHub"
      ]
    },
    {
      "company": "ValCredit (Freelancer)",
      "position": "Desarrollador Front End",
      "dateInit": "2023-10",
      "dateEnd": "2023-12",
      "website": {
        "url": "https://www.valcredit.co/",
        "show": true
      },
      "description": [
        "Desarrollar una solución integral para el control y gestión de finanzas, priorizando la seguridad en el manejo de datos sensibles y la claridad en la visualización de datos."
      ],
      "technologies": [
        "JavaScript",
        "React",
        "HTML",
        "CSS",
        "SASS",
        "Vite",
        "ReactHookForm",
        "ReactRouter",
        "MSW",
        "Postman",
        "Git",
        "GitHub"
      ]
    },
    {
      "company": "Teleperformance",
      "position": "Desarrollador Front End Senior",
      "dateInit": "2021-10",
      "dateEnd": "2024-12",
      "website": {
        "url": "https://www.teleperformance.com/",
        "show": true
      },
      "description": [
        "Diseñar y arquitectar un asistente interactivo impulsado por IA integrado en los aplicativos internos, actuando como guía inteligente para optimizar la curva de aprendizaje y la navegación de los usuarios.",
        "Liderar el desarrollo de sistemas críticos de capacitación empresarial, optimizando la experiencia de aprendizaje para clientes globales mediante interfaces de alto rendimiento.",
        "Arquitectar y desplegar un CMS modular (Dashboard, Forecast y Apps), permitiendo una gestión de contenidos centralizada y eficiente con visualización de datos compleja.",
        "Desarrollar entornos de simulación de alta fidelidad para aplicaciones en entornos no productivos, facilitando el onboarding y la apropiación tecnológica sin riesgos operativos.",
        "Garantizar la integridad y seguridad del código mediante la implementación de auditorías de seguridad, resolviendo vulnerabilidades críticas y elevando los estándares de QA.",
        "Gestionar el ciclo de vida de aplicaciones de gestión de archivos y permisos, asegurando una trazabilidad robusta y un control de acceso granular."
      ],
      "technologies": [
        "JavaScript",
        "TypeScript",
        "React",
        "Angular",
        "HTML",
        "CSS",
        "SASS",
        "TailwindCSS",
        "Vite",
        "Redux",
        "ChartJS",
        "ReactHookForm",
        "ReactRouter",
        "Vitest",
        "MSW",
        "Postman",
        "Firebase",
        "OWASPZAP",
        "SonarQube",
        "Git",
        "GitHub",
        "Bitbucket",
        "Azure"
      ]
    },
    {
      "company": "Mercado Libre",
      "position": "Ingeniero de Software",
      "dateInit": "2025-01",
      "dateEnd": "",
      "website": {
        "url": "https://www.mercadolibre.com/",
        "show": true
      },
      "description": [
        "Liderar la definición técnica de iniciativas de gran escala mediante la redacción de RFCs, coordinando el consenso entre equipos de Producto, UX y Backend para garantizar arquitecturas sólidas y escalables.",
        "Diseñar y mantener aplicaciones web modulares y escalables en entornos de alto tráfico, optimizando Web Vitals y métricas de performance para asegurar experiencias de usuario rápidas y confiables.",
        "Crear, disponibilizar y mantener infraestructura y ambientes de despliegue (IaC), asegurando la correcta configuración y disponibilidad de los entornos de las aplicaciones.",
        "Gestionar repositorios críticos de enrutamiento y manejo de tráfico, asegurando una navegación fluida y una distribución de carga eficiente en el ecosistema frontend.",
        "Liderar la implementación de estrategias de testing automatizado E2E impulsadas por IA, elevando los estándares de calidad y reduciendo significativamente los tiempos de regresión.",
        "Diseñar e implementar arquitecturas de tracking y medición de datos, garantizando la trazabilidad de eventos de negocio para la toma de decisiones informadas.",
        "Impulsar la cultura de excelencia técnica a través de code reviews y estrategias de observabilidad, garantizando la resiliencia del código y la detección temprana de errores en producción.",
        "Investigar, documentar y mitigar vulnerabilidades de seguridad, asegurando que las aplicaciones cumplan con los más altos estándares de protección y protección de datos.",
        "Publicar y mantener librerías y módulos compartidos, facilitando la reutilización de código y la consistencia técnica entre los diferentes equipos de la organización."
      ],
      "technologies": [
        "JavaScript",
        "TypeScript",
        "React",
        "HTML",
        "CSS",
        "SASS",
        "Webpack",
        "SSR",
        "Postman",
        "Git",
        "GitHub",
        "AWS",
        "GoogleCloud",
        "Azure",
        "Jest",
        "Cucumber",
        "Nginx",
        "Cursor",
        "Claude",
        "Figma"
      ]
    }
  ]
}
